{
  "navigation": {
    "dashboard": "Painel",
    "projects": "Projetos",
    "products": "Produtos",
    "catalog": "Catálogo",
    "profitCalculator": "Calculadora de Lucro",
    "sampleOrders": "Pedidos de Amostra",
    "getStarted": "Começar"
  },
  "actions": {
    "save": "Salvar",
    "cancel": "Cancelar",
    "delete": "Excluir",
    "edit": "Editar",
    "create": "Criar",
    "submit": "Enviar",
    "back": "Voltar"
  },
  "messages": {
    "loading": "Carregando...",
    "error": "Ocorreu um erro",
    "success": "Sucesso!",
    "noData": "Nenhum dado disponível"
  },
  "dashboard": {
    "welcome": "Bem-vindo!",
    "overview": "Visão Geral",
    "recentActivity": "Atividade Recente",
    "upcomingTasks": "Próximas Tarefas"
  },
  "auth": {
    "login": "Entrar",
    "signup": "Cadastrar",
    "logout": "Sair",
    "email": "Email",
    "password": "Senha",
    "createAccount": "Crie sua conta",
    "joinUs": "Junte-se a nós e comece a construir sua marca",
    "firstName": "Nome",
    "lastName": "Sobrenome",
    "passwordPlaceholder": "••••••••",
    "emailPlaceholder": "seu@email.com",
    "alreadyHaveAccount": "Já tem uma conta?",
    "signIn": "Entrar",
    "creatingAccount": "Criando conta...",
    "loginTitle": "Entre na sua conta",
    "loginSubtitle": "Transforme suas ideias em produtos incríveis",
    "forgotPassword": "Esqueceu sua senha?",
    "signingIn": "Entrando...",
    "loginError": "Erro de Login",
    "loginErrorMessage": "Email ou senha incorretos. Por favor, tente novamente."
  },
  "onboarding": {
    "welcome": {
      "title": "Bem-vindo à sua Jornada de Marca Própria",
      "description": "Estamos entusiasmados em conhecer mais sobre você e seu projeto. Vamos personalizar nossa plataforma para atender perfeitamente às suas necessidades e ajudá-lo a construir uma marca de sucesso.",
      "startButton": "Iniciar Minha Jornada"
    },
    "productCategories": {
      "title": "Qual segmento mais combina com seu projeto?",
      "description": "Selecione uma ou mais categorias que você gostaria de explorar. Cada categoria foi cuidadosamente selecionada com base em tendências de mercado e oportunidades de negócio.",
      "categories": {
        "cosmetics": "Cosméticos e Cuidados Pessoais",
        "cosmeticsDescription": "Desenvolva produtos inovadores para cuidados com a pele, cabelo e bem-estar pessoal. Nossa linha inclui fórmulas exclusivas com ingredientes naturais e tecnológicos, perfeitos para criar uma marca diferenciada no mercado de beleza.",
        "coffee": "Café Gourmet e Especiais",
        "coffeeDescription": "Crie sua marca de café premium com grãos selecionados e processos artesanais. Oferecemos blends exclusivos, torras personalizadas e opções orgânicas para atender um público cada vez mais exigente.",
        "supplements": "Suplementos Nutricionais",
        "supplementsDescription": "Lance sua linha de suplementos com fórmulas inovadoras para saúde, bem-estar e performance. Desenvolvemos produtos com ingredientes de alta qualidade, certificações e embalagens premium.",
        "petProducts": "Produtos Premium para Pets",
        "petProductsDescription": "Entre no crescente mercado pet com produtos de alta qualidade. Nossa linha inclui alimentos naturais, suplementos e produtos de cuidados, desenvolvidos por especialistas em nutrição animal."
      }
    },
    "profileType": {
      "title": "Como você definiria seu perfil empreendedor?",
      "description": "Sua resposta nos ajudará a personalizar nossa abordagem e recomendações específicas para seu modelo de negócio.",
      "types": {
        "entrepreneur": "Empreendedor Individual",
        "entrepreneurDescription": "Ideal para profissionais autônomos, influenciadores digitais ou microempreendedores que desejam criar sua primeira marca própria. Oferecemos suporte completo desde o desenvolvimento do produto até o lançamento.",
        "startup": "Startup ou Empresa Emergente",
        "startupDescription": "Perfeito para empresas inovadoras em fase inicial que buscam escalar com produtos próprios. Nosso programa inclui suporte em desenvolvimento de produto, branding e estratégias de crescimento.",
        "established": "Empresa Estabelecida",
        "establishedDescription": "Para negócios consolidados que desejam expandir seu portfólio com marca própria. Oferecemos soluções personalizadas que se integram à sua operação existente e ampliam seu alcance no mercado.",
        "other": "Outro Perfil",
        "otherDescription": "Tem um perfil diferenciado ou necessidades específicas? Conte-nos mais sobre seu projeto e desenvolveremos uma solução sob medida para seus objetivos."
      }
    },
    "brandStatus": {
      "title": "Em que estágio está sua marca?",
      "description": "Entender o atual momento da sua marca nos permite oferecer o suporte mais adequado para impulsionar seu crescimento.",
      "options": {
        "noBrand": "Iniciando do Zero",
        "noBrandDescription": "Perfeito para quem está começando agora. Vamos desenvolver juntos todos os elementos da sua marca, desde o nome até a identidade visual completa, garantindo uma base sólida para seu sucesso.",
        "partialBrand": "Identidade em Desenvolvimento",
        "partialBrandDescription": "Ideal para quem já tem alguns elementos como nome ou logo. Vamos refinar e complementar sua identidade visual, garantindo consistência e profissionalismo em todos os pontos de contato.",
        "completeBrand": "Marca Estabelecida",
        "completeBrandDescription": "Para marcas com identidade visual definida. Vamos garantir que seus novos produtos mantenham a consistência com suas diretrizes de marca existentes, fortalecendo ainda mais seu posicionamento."
      }
    },
    "launchUrgency": {
      "title": "Qual é seu horizonte de lançamento?",
      "description": "O prazo que você tem em mente nos ajuda a estabelecer um cronograma adequado e priorizar as etapas do seu projeto.",
      "options": {
        "immediate": "Lançamento Imediato",
        "immediateDescription": "Para projetos que precisam ir ao mercado nos próximos 1-2 meses. Nossa equipe prioriza seu projeto com processos acelerados, mantendo a qualidade e atenção aos detalhes.",
        "soon": "Planejamento Curto Prazo",
        "soonDescription": "Ideal para lançamentos em 3-6 meses. Tempo suficiente para um planejamento detalhado, desenvolvimento cuidadoso e estratégia de lançamento bem estruturada.",
        "planning": "Planejamento Estratégico",
        "planningDescription": "Para projetos com horizonte de 6+ meses. Permite uma abordagem abrangente, com pesquisa de mercado aprofundada, testes de produto e estratégia de marca robusta."
      }
    },
    "navigation": {
      "back": "Voltar",
      "next": "Avançar",
      "complete": "Finalizar"
    }
  }
}